Hey, William (@lamw) - 

I had a chance to successfully test this today on AArch64 / ARM6 using your `Nested_ESXi7.0u3_Appliance_Template_v1.ova` OVA image and a crash was not observed.

Below are the environment specs.

- Ubuntu 20.04 LTS on Raspberry Pi 4 8GB

```console
   ubuntu@arctic:~$ terraform version
   Terraform v1.1.2
   on linux_arm64
   + provider registry.terraform.io/hashicorp/vsphere v2.0.2

   ubuntu@arctic:~$ go version
   go version go1.17.5 linux/arm64
```

- VMware vSphere Client version 7.0.3.00100
- VMware ESXi, 7.0.2, 18538813 

`main.tf`

```hcl
terraform {
  required_providers {
    vsphere = {
      source  = "hashicorp/vsphere"
      version = ">= 2.0.2"
    }
  }
  required_version = ">= 1.1.2"
}

provider "vsphere" {
  vsphere_server       = "m01-vc01.rainpole.io"
  user                 = "administrator@vsphere.local"
  password             = "VMware1!"
  allow_unverified_ssl = true
}

##################################################################################
# DATA
##################################################################################

data "vsphere_datacenter" "datacenter" {
  name = "m01-dc01"
}

data "vsphere_datastore" "datastore" {
  name          = "local-ssd-01"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_compute_cluster" "cluster" {
  name          = "m01-cl01"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_resource_pool" "pool" {
  name          = format("%s%s", data.vsphere_compute_cluster.cluster.name, "/Resources")
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_host" "host" {
  name          = "m01-esx01.rainpole.io"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}

data "vsphere_network" "network" {
  name          = "M - 172.16.11.0"
  datacenter_id = data.vsphere_datacenter.datacenter.id
}
data "vsphere_ovf_vm_template" "ovf" {
  name             = "Nested_ESXi7.0u3_Appliance_Template_v1"
  resource_pool_id = data.vsphere_resource_pool.pool.id
  datastore_id     = data.vsphere_datastore.datastore.id
  host_system_id   = data.vsphere_host.host.id
  remote_ovf_url   = "https://download3.vmware.com/software/vmw-tools/nested-esxi/Nested_ESXi7.0u3_Appliance_Template_v1.ova"
  ovf_network_map = {
    "Trunk 1" : data.vsphere_network.network.id
    "Trunk 2" : data.vsphere_network.network.id
    "Trunk 3" : data.vsphere_network.network.id
    "Trunk 4" : data.vsphere_network.network.id
  }
}
##################################################################################
# RESOURCES
##################################################################################

resource "vsphere_virtual_machine" "nested_esxi" {
  name                 = "nested-esx01"
  folder               = ""
  resource_pool_id     = data.vsphere_resource_pool.pool.id
  datastore_id         = data.vsphere_datastore.datastore.id
  datacenter_id        = data.vsphere_datacenter.datacenter.id
  host_system_id       = data.vsphere_host.host.id
  num_cpus             = data.vsphere_ovf_vm_template.ovf.num_cpus
  num_cores_per_socket = data.vsphere_ovf_vm_template.ovf.num_cores_per_socket
  memory               = data.vsphere_ovf_vm_template.ovf.memory
  guest_id             = data.vsphere_ovf_vm_template.ovf.guest_id
  nested_hv_enabled    = data.vsphere_ovf_vm_template.ovf.nested_hv_enabled
  dynamic "network_interface" {
    for_each = data.vsphere_ovf_vm_template.ovf.ovf_network_map
    content {
      network_id = network_interface.value
    }
  }
  wait_for_guest_net_timeout = 0
  wait_for_guest_ip_timeout  = 0

  ovf_deploy {
    allow_unverified_ssl_cert = true
    remote_ovf_url            = "https://download3.vmware.com/software/vmw-tools/nested-esxi/Nested_ESXi7.0u3_Appliance_Template_v1.ova"
    disk_provisioning         = "thin"
    ovf_network_map           = data.vsphere_ovf_vm_template.ovf.ovf_network_map
  }
  vapp {
    properties = {
      "guestinfo.hostname"  = "nested-esx01.rainpole.io",
      "guestinfo.ipaddress" = "172.16.11.101",
      "guestinfo.netmask"   = "255.255.255.0",
      "guestinfo.gateway"   = "172.16.11.1",
      "guestinfo.vlan"      = "1611",
      "guestinfo.dns"       = "172.16.11.11",
      "guestinfo.domain"    = "rainpole.io",
      "guestinfo.ntp"       = "172.16.11.11",
      "guestinfo.password"  = "VMware1!"
    }
  }
  lifecycle {
    ignore_changes = [
      annotation,
      disk[0].io_share_count,
      disk[1].io_share_count,
      disk[2].io_share_count,
      vapp[0].properties,
    ]
  }
}
```

`terraform init`

```console
ubuntu@arctic:~$ terraform init

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/vsphere versions matching ">= 2.0.2"...
- Installing hashicorp/vsphere v2.0.2...
- Installed hashicorp/vsphere v2.0.2 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

`terraform validate`

```console
ubuntu@arctic:~$ terraform validate
Success! The configuration is valid.
```

`terraform plan`

```console
ubuntu@arctic:~$ terraform plan

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated
with the following symbols:
  + create

Terraform will perform the following actions:

  # vsphere_virtual_machine.nested_esxi will be created
  + resource "vsphere_virtual_machine" "nested_esxi" {
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datacenter_id                           = "datacenter-3"
      + datastore_id                            = "datastore-11"
      + default_ip_address                      = (known after apply)
      + ept_rvi_mode                            = "automatic"
      + firmware                                = "bios"
      + force_power_off                         = true
      + guest_id                                = "vmkernel65Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = "host-10"
      + hv_mode                                 = "hvAuto"
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 8192
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = "nested-esx01"
      + nested_hv_enabled                       = true
      + num_cores_per_socket                    = 1
      + num_cpus                                = 2
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-6046"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + uuid                                    = (known after apply)
      + vapp_transport                          = (known after apply)
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 0

      + disk {
          + attach            = (known after apply)
          + controller_type   = (known after apply)
          + datastore_id      = (known after apply)
          + device_address    = (known after apply)
          + disk_mode         = (known after apply)
          + disk_sharing      = (known after apply)
          + eagerly_scrub     = (known after apply)
          + io_limit          = (known after apply)
          + io_reservation    = (known after apply)
          + io_share_count    = (known after apply)
          + io_share_level    = (known after apply)
          + keep_on_remove    = (known after apply)
          + key               = (known after apply)
          + label             = (known after apply)
          + path              = (known after apply)
          + size              = (known after apply)
          + storage_policy_id = (known after apply)
          + thin_provisioned  = (known after apply)
          + unit_number       = (known after apply)
          + uuid              = (known after apply)
          + write_through     = (known after apply)
        }

      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "network-1001"
        }
      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "network-1001"
        }
      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "network-1001"
        }
      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "network-1001"
        }

      + ovf_deploy {
          + allow_unverified_ssl_cert = true
          + disk_provisioning         = "thin"
          + enable_hidden_properties  = false
          + ovf_network_map           = {
              + "Trunk 1" = "network-1001"
              + "Trunk 2" = "network-1001"
              + "Trunk 3" = "network-1001"
              + "Trunk 4" = "network-1001"
            }
          + remote_ovf_url            = "https://download3.vmware.com/software/vmw-tools/nested-esxi/Nested_ESXi7.0u3_Appliance_Template_v1.ova"
        }

      + vapp {
          + properties = {
              + "guestinfo.dns"       = "172.16.11.11"
              + "guestinfo.domain"    = "rainpole.io"
              + "guestinfo.gateway"   = "172.16.11.1"
              + "guestinfo.hostname"  = "nested-esx01.rainpole.io"
              + "guestinfo.ipaddress" = "172.16.11.101"
              + "guestinfo.netmask"   = "255.255.255.0"
              + "guestinfo.ntp"       = "172.16.11.11"
              + "guestinfo.password"  = "VMware1!"
              + "guestinfo.vlan"      = "1611"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these
actions if you run "terraform apply" now.
```

`terraform apply --auto-approve`

```console
ubuntu@arctic:~$ terraform apply --auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated
with the following symbols:
  + create

Terraform will perform the following actions:

  # vsphere_virtual_machine.nested_esxi will be created
  + resource "vsphere_virtual_machine" "nested_esxi" {
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datacenter_id                           = "datacenter-3"
      + datastore_id                            = "datastore-11"
      + default_ip_address                      = (known after apply)
      + ept_rvi_mode                            = "automatic"
      + firmware                                = "bios"
      + force_power_off                         = true
      + guest_id                                = "vmkernel65Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = "host-10"
      + hv_mode                                 = "hvAuto"
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 8192
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = "nested-esx01"
      + nested_hv_enabled                       = true
      + num_cores_per_socket                    = 1
      + num_cpus                                = 2
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-6046"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + uuid                                    = (known after apply)
      + vapp_transport                          = (known after apply)
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 0

      + disk {
          + attach            = (known after apply)
          + controller_type   = (known after apply)
          + datastore_id      = (known after apply)
          + device_address    = (known after apply)
          + disk_mode         = (known after apply)
          + disk_sharing      = (known after apply)
          + eagerly_scrub     = (known after apply)
          + io_limit          = (known after apply)
          + io_reservation    = (known after apply)
          + io_share_count    = (known after apply)
          + io_share_level    = (known after apply)
          + keep_on_remove    = (known after apply)
          + key               = (known after apply)
          + label             = (known after apply)
          + path              = (known after apply)
          + size              = (known after apply)
          + storage_policy_id = (known after apply)
          + thin_provisioned  = (known after apply)
          + unit_number       = (known after apply)
          + uuid              = (known after apply)
          + write_through     = (known after apply)
        }

      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "network-1001"
        }
      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "network-1001"
        }
      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "network-1001"
        }
      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "network-1001"
        }

      + ovf_deploy {
          + allow_unverified_ssl_cert = true
          + disk_provisioning         = "thin"
          + enable_hidden_properties  = false
          + ovf_network_map           = {
              + "Trunk 1" = "network-1001"
              + "Trunk 2" = "network-1001"
              + "Trunk 3" = "network-1001"
              + "Trunk 4" = "network-1001"
            }
          + remote_ovf_url            = "https://download3.vmware.com/software/vmw-tools/nested-esxi/Nested_ESXi7.0u3_Appliance_Template_v1.ova"
        }

      + vapp {
          + properties = {
              + "guestinfo.dns"       = "172.16.11.11"
              + "guestinfo.domain"    = "rainpole.io"
              + "guestinfo.gateway"   = "172.16.11.1"
              + "guestinfo.hostname"  = "nested-esx01.rainpole.io"
              + "guestinfo.ipaddress" = "172.16.11.101"
              + "guestinfo.netmask"   = "255.255.255.0"
              + "guestinfo.ntp"       = "172.16.11.11"
              + "guestinfo.password"  = "VMware1!"
              + "guestinfo.vlan"      = "1611"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
vsphere_virtual_machine.nested_esxi: Creating...
vsphere_virtual_machine.nested_esxi: Still creating... [10s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [20s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [30s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [40s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [50s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [1m0s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [1m10s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [1m20s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [1m30s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [1m40s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [1m50s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [2m0s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [2m10s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [2m20s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [2m30s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [2m40s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [2m50s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [3m0s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [3m10s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [3m20s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [3m30s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [3m40s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [3m50s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [4m0s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [4m10s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [4m20s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [4m30s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [4m40s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [4m50s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [5m0s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [5m10s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [5m20s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [5m30s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [5m40s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [5m50s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [6m0s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [6m10s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [6m20s elapsed]
vsphere_virtual_machine.nested_esxi: Still creating... [6m30s elapsed]
vsphere_virtual_machine.nested_esxi: Creation complete after 6m34s [id=42022cb3-88d1-a9f4-7ef5-7ee4a1d4fd65]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

![image](https://user-images.githubusercontent.com/7771363/148113179-461b09e4-d154-4f44-b87f-d8b6ff33e287.png)

Ryan